public class JAVA_01_01_변수 {

	public static void main(String[] args) {
		// 변수란?
		// 기본적으로 값을 저장할 수 있는 메모리 공간을 의미한다.
		
		// 변수에는 타입이 존재하는데,
		// 타입을 쓴 후 변수 이름을 쓰면 
		// 그 타입에 맞는 변수가 생성된다.
		// 또한 변수 타입에 따라 
		// 크기가 달라지므로 상황에 맞는 타입을 써야한다.
		
		// 선언 방법
		// 타입 변수이릅;
		
		
		// JAVA 식별자 명명규칙이란?
		// JAVA에서 식별자 이름에 있는 규칙이다.
		// 하나 이상의 글자로 이루어져야 함
		// 첫 번째 글자는 문자 이거나 '$', '_'이어야 함
		// 두번재 이후의 글자는 숫자, 문자, '$', '_'이어야 함
		// '$', '_' 이외의 특수문자 사용 불가능
		// 길이 제한이 없음
		// 키워드는 식별자로 사용할 수 없음
		// 상수 값을 표현하는 단어 true, false, null은 식별자로 사용할 수 없음
		
		
		//변수 명명 관례
		// 변수에도 명명관례라는 것이 존재하는데 
		// 이는 변수 이름에 존재하는 관례이다.
		//첫 번째 문자가 소문자인 명사로 정함
		//여러 단어로 구성된 이름의 경우 두번째 단어부터 첫글자를 대문자로 함
		//'_'을 쓰지 않음
		//규칙은 반드시 지켜야 한다. 지키지 않으면 컴파일시 에러가 발생함.
		//관례는 지키지 않아도 컴파일에러가 발생하지는 않지만, 약속이기 때문에 지켜주는것이 좋다.
	}

}
